{
    "volunteering": [
      {
        "title": "Career Forge Phase 01",
        "description": "Contributed as a Secretary Team Member to Career Forge Phase 01, a career guidance program aimed at enhancing students' professional development.",
        "date": "August 2024",
        "image": "gallary/careerforge.png"
      },
      {
        "title": " PearlHack 2.0",
        "description": "Played a key role as an organizing committee member for PearlHack 2.0, a hackathon designed to foster creativity and technical skills among students.",
        "date": "May 2024",
        "image": "gallary/pearl.jpg"
      },
      {
        "title": " IEEE Innovation Sri Lanka Provincial Competition",
        "description": "Successfully managed delegates for the IEEE Innovation Sri Lanka Provincial Competition, coordinating participants and ensuring smooth event execution.",
        "date": "September 2023",
        "image": "gallary/innovation.png"
      }
    ],
    "certificates": [
      {
        "title": "CodeSprint 8 (IEEE Student Branch of IIT)",
        "description": "Recognized as semi-finalists in CodeSprint 8, a competitive coding event organized by the IEEE Student Branch of IIT, showcasing problem-solving and programming skills.",
        "date": "June 2024",
        "image": "gallary/codes.jpg"
      },
      {
        "title": "Code with WIE",
        "description": "Achieved finalist status in the Code with WIE competition, highlighting innovative thinking and technical abilities in a competitive environment.p",
        "date": "December 2023",
        "image": "gallary/code.jpg"
      },
      {
        "title": "SLTC Inter-University Game Development Competition",
        "description": "Earned finalist recognition and popularity for creating a game trailer video in the SLTC Inter-University Game Development Competition, emphasizing creativity and storytelling.",
        "date": "November 2021",
        "image": "gallary/sltc.jpg"
      }
    ],
    "hackathons": [
      {
        "title": "Industrial Visit",
        "description": "Participated in the Industrial Visit for 2nd-year Software Engineering students to CodeGen International and Zone 24x7 on 9th February 2024, gaining valuable insights into technology and innovation.",
        "date": "May 2023",
        "image": "gallary/zone.jpg"
      },
      {
        "title": "The Modern Javascript for Beginners",
        "description": "I completed the 'Modern JavaScript for Beginners' course on Udemy, enhancing my understanding of JavaScript fundamentals and advanced concepts, including DOM manipulation and asynchronous programming.",
        "date": "October 2022",
        "image": "gallary/udemy.png"
      },
      {
        "title": "React.js Essential Training",
        "description": "I successfully completed the 'React.js Essential Training' course on LinkedIn Learning, where I gained hands-on experience with React fundamentals, components, state management, and best practices for building dynamic, interactive web applications.",
        "date": "May 2023",
        "image": "gallary/in.jpg"
      },
      {
        "title": "Bootstrap 5 Essential Training",
        "description": "I Successfully completed LinkedIn Learning's Bootstrap 5 Essential Training, mastering the creation of responsive, mobile-first websites with modern design techniques using Bootstrap.",
        "date": "May 2023",
        "image": "gallary/bootin.png"
      },
      {
        "title": "Tailwind CSS 3 Essential Training",
        "description": "I Completed LinkedIn Learning's Tailwind CSS 3 Essential Training, gaining proficiency in building utility-first, customizable, and scalable web designs using Tailwind CSS.",
        "date": "May 2023",
        "image": "gallary/tailin.png"
      }
    ]
  }
  